lkolbly/cmsis-svd/data/TexasInstruments/LM3S101.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>Register map for FLASH_CTRL peripheral</description>
      <groupName>FLASH_CTRL</groupName>
      <prependToName>FLASH_CTRL</prependToName>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FMA</name>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMA_OFFSET</name>
              <description>Address Offset</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMD</name>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMD_DATA</name>
              <description>Data Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMC_WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_COMT</name>
              <description>Commit Register Value</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_WRKEY</name>
              <description>FLASH write key</description>
              <bitRange>[31:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCRIS</name>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCRIS_ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCIM</name>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCIM_AMASK</name>
              <description>Access Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_PMASK</name>
              <description>Programming Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMISC</name>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCMISC_AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE</name>
          <description>Flash Memory Protection Read Enable</description>
          <addressOffset>0x00001130</addressOffset>
        </register>
        <register>
          <name>FMPPE</name>
          <description>Flash Memory Protection Program Enable</description>
          <addressOffset>0x00001134</addressOffset>
        </register>
        <register>
          <name>USECRL</name>
          <description>USec Reload</description>
          <addressOffset>0x00001140</addressOffset>
          <fields>
            <field>
              <name>FLASH_USECRL</name>
              <description>Microsecond Reload Value</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL</name>
      <description>Register map for SYSCTL peripheral</description>
      <groupName>SYSCTL</groupName>
      <prependToName>SYSCTL</prependToName>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DID0</name>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID0_MIN</name>
              <description>Minor Revision</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_1</name>
                  <description>First metal layer change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_2</name>
                  <description>Second metal layer change</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_MAJ</name>
              <description>Major Revision</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_VER</name>
              <description>DID0 Version</description>
              <bitRange>[30:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_VER_0</name>
                  <description>Initial DID0 register format definition for Stellaris(R) Sandstorm-class devices</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DID1</name>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID1_QUAL</name>
              <description>Qualification Status</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_ROHS</name>
              <description>RoHS-Compliance</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DID1_PKG</name>
              <description>Package Type</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_SOIC</name>
                  <description>SOIC package</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_QFP</name>
                  <description>LQFP package</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_QFN</name>
                  <description>QFN package</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_TEMP</name>
              <description>Temperature Range</description>
              <bitRange>[7:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_C</name>
                  <description>Commercial temperature range (0C to 70C)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_I</name>
                  <description>Industrial temperature range (-40C to 85C)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_E</name>
                  <description>Extended temperature range (-40C to 105C)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PRTNO</name>
              <description>Part Number</description>
              <bitRange>[23:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PRTNO_101</name>
                  <description>LM3S101</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_FAM</name>
              <description>Family</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_FAM_STELLARIS</name>
                  <description>Stellaris family of microcontollers, that is, all devices with external part numbers starting with LM3S</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_VER</name>
              <description>DID1 Version</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_VER_0</name>
                  <description>Initial DID1 register format definition, indicating a Stellaris LM3Snnn device</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0</name>
          <description>Device Capabilities 0</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC0_FLASHSZ</name>
              <description>Flash Size</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC0_FLASHSZ_8KB</name>
                  <description>8 KB of Flash</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC0_SRAMSZ</name>
              <description>SRAM Size</description>
              <bitRange>[31:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC0_SRAMSZ_2KB</name>
                  <description>2 KB of SRAM</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1</name>
          <description>Device Capabilities 1</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC1_JTAG</name>
              <description>JTAG Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_SWD</name>
              <description>SWD Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_SWO</name>
              <description>SWO Trace Port Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_WDT0</name>
              <description>Watchdog Timer 0 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_PLL</name>
              <description>PLL Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC1_MINSYSDIV</name>
              <description>System Clock Divider</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC1_MINSYSDIV_20</name>
                  <description>Specifies a 20-MHz clock with a PLL divider of 10</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC2</name>
          <description>Device Capabilities 2</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC2_UART0</name>
              <description>UART Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_SSI0</name>
              <description>SSI Module 0 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_TIMER0</name>
              <description>Timer Module 0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_TIMER1</name>
              <description>Timer Module 1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_COMP0</name>
              <description>Analog Comparator 0 Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC2_COMP1</name>
              <description>Analog Comparator 1 Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC3</name>
          <description>Device Capabilities 3</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC3_C0MINUS</name>
              <description>C0- Pin Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C0PLUS</name>
              <description>C0+ Pin Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C0O</name>
              <description>C0o Pin Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_C1MINUS</name>
              <description>C1- Pin Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_CCP0</name>
              <description>CCP0 Pin Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC3_32KHZ</name>
              <description>32KHz Input Clock Available</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC4</name>
          <description>Device Capabilities 4</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC4_GPIOA</name>
              <description>GPIO Port A Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOB</name>
              <description>GPIO Port B Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOC</name>
              <description>GPIO Port C Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PBORCTL</name>
          <description>Brown-Out Reset Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PBORCTL_BORWT</name>
              <description>BOR Wait and Check for Noise</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PBORCTL_BORIOR</name>
              <description>BOR Interrupt or Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PBORCTL_BORTIM</name>
              <description>BOR Time Delay</description>
              <bitRange>[15:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOPCTL</name>
          <description>LDO Power Control</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOPCTL</name>
              <description>LDO Output Voltage</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_50V</name>
                  <description>2.50</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_45V</name>
                  <description>2.45</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_40V</name>
                  <description>2.40</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_35V</name>
                  <description>2.35</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_30V</name>
                  <description>2.30</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_25V</name>
                  <description>2.25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_75V</name>
                  <description>2.75</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_70V</name>
                  <description>2.70</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_65V</name>
                  <description>2.65</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_60V</name>
                  <description>2.60</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_55V</name>
                  <description>2.55</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
        </register>
