lkolbly/cmsis-svd/data/TexasInstruments/LM3S101.svd
        <register>
          <name>FAULT_STAT</name>
          <description>Configurable Fault Status</description>
          <addressOffset>0x00000D28</addressOffset>
          <fields>
            <field>
              <name>NVIC_FAULT_STAT_IERR</name>
              <description>Instruction Access Violation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MMARV</name>
              <description>Memory Management Fault Address Register Valid</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IBUS</name>
              <description>Instruction Bus Error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_PRECISE</name>
              <description>Precise Data Bus Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IMPRE</name>
              <description>Imprecise Data Bus Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BUSTKE</name>
              <description>Unstack Bus Fault</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BSTKE</name>
              <description>Stack Bus Fault</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BFARV</name>
              <description>Bus Fault Address Register Valid</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNDEF</name>
              <description>Undefined Instruction Usage Fault</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVSTAT</name>
              <description>Invalid State Usage Fault</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVPC</name>
              <description>Invalid PC Load Usage Fault</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_NOCP</name>
              <description>No Coprocessor Usage Fault</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNALIGN</name>
              <description>Unaligned Access Usage Fault</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_DIV0</name>
              <description>Divide-by-Zero Usage Fault</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HFAULT_STAT</name>
          <description>Hard Fault Status</description>
          <addressOffset>0x00000D2C</addressOffset>
          <fields>
            <field>
              <name>NVIC_HFAULT_STAT_VECT</name>
              <description>Vector Table Read Fault</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_FORCED</name>
              <description>Forced Hard Fault</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_DBG</name>
              <description>Debug Event</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_STAT</name>
          <description>Debug Status Register</description>
          <addressOffset>0x00000D30</addressOffset>
          <fields>
            <field>
              <name>NVIC_DEBUG_STAT_HALTED</name>
              <description>Halt request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_BKPT</name>
              <description>Breakpoint instruction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_DWTTRAP</name>
              <description>DWT match</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_VCATCH</name>
              <description>Vector catch</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_EXTRNL</name>
              <description>EDBGRQ asserted</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_ADDR</name>
          <description>Memory Management Fault Address</description>
          <addressOffset>0x00000D34</addressOffset>
          <fields>
            <field>
              <name>NVIC_MM_ADDR</name>
              <description>Fault Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT_ADDR</name>
          <description>Bus Fault Address</description>
          <addressOffset>0x00000D38</addressOffset>
          <fields>
            <field>
              <name>NVIC_FAULT_ADDR</name>
              <description>Fault Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CTRL</name>
          <description>Debug Control and Status Reg</description>
          <addressOffset>0x00000DF0</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_CTRL_C_DEBUGEN</name>
              <description>Enable debug</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_HALT</name>
              <description>Halt the core</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_STEP</name>
              <description>Step the core</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_MASKINT</name>
              <description>Mask interrupts when stepping</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_SNAPSTALL</name>
              <description>Breaks a stalled load/store</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_REGRDY</name>
              <description>Register read/write available</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_HALT</name>
              <description>Core status on halt</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_SLEEP</name>
              <description>Core is sleeping</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_LOCKUP</name>
              <description>Core is locked up</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RETIRE_ST</name>
              <description>Core has executed insruction since last read</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RESET_ST</name>
              <description>Core has reset since last read</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_XFER</name>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_XFER_REG_SEL</name>
              <description>Register</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R0</name>
                  <description>Register R0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R1</name>
                  <description>Register R1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R2</name>
                  <description>Register R2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R3</name>
                  <description>Register R3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R4</name>
                  <description>Register R4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R5</name>
                  <description>Register R5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R6</name>
                  <description>Register R6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R7</name>
                  <description>Register R7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R8</name>
                  <description>Register R8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R9</name>
                  <description>Register R9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R10</name>
                  <description>Register R10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R11</name>
                  <description>Register R11</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R12</name>
                  <description>Register R12</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R13</name>
                  <description>Register R13</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R14</name>
                  <description>Register R14</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R15</name>
                  <description>Register R15</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_FLAGS</name>
                  <description>xPSR/Flags register</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_MSP</name>
                  <description>Main SP</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_PSP</name>
                  <description>Process SP</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_DSP</name>
                  <description>Deep SP</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_CFBP</name>
                  <description>Control/Fault/BasePri/PriMask</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_DBG_XFER_REG_WNR</name>
              <description>Write or not read</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_DATA</name>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_DATA</name>
              <description>Data temporary cache</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_INT</name>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_INT_RSTVCATCH</name>
              <description>Reset vector catch</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDING</name>
              <description>Core reset is pending</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDCLR</name>
              <description>Clear pending core reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RESET</name>
              <description>Core reset status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_MMERR</name>
              <description>Debug trap on mem manage fault</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_NOCPERR</name>
              <description>Debug trap on coprocessor error</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_CHKERR</name>
              <description>Debug trap on usage fault check</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_STATERR</name>
              <description>Debug trap on usage fault state</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_BUSERR</name>
              <description>Debug trap on bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_INTERR</name>
              <description>Debug trap on interrupt errors</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_HARDERR</name>
              <description>Debug trap on hard fault</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_TRIG</name>
          <description>Software Trigger Interrupt</description>
          <addressOffset>0x00000F00</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>NVIC_SW_TRIG_INTID</name>
              <description>Interrupt ID</description>
              <bitRange>[4:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for lm3s101</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for lm3s101</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000800</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
